In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame
from numpy.random import randn

In [3]:
dframe = DataFrame({'k1':['X','X','Y','Y','Z'],
                   'k2':['alpha','beta','alpha','beta','alpha'],
                   'dataset1':np.random.rand(5),
                   'dataset2':np.random.rand(5)})
dframe

   dataset1  dataset2 k1     k2
0  0.818973  0.296009  X  alpha
1  0.082489  0.410518  X   beta
2  0.719690  0.580187  Y  alpha
3  0.548029  0.431855  Y   beta
4  0.967873  0.149909  Z  alpha

In [4]:
group1 = dframe['dataset1'].groupby(dframe['k1'])
group1

In [6]:
group1.mean()

k1
X    0.450731
Y    0.633859
Z    0.967873
Name: dataset1, dtype: float64

In [7]:
cities = np.array(['NY','LA','LA','NY','NY'])
month = np.array(['JAN','FEB','JAN','FEB','JAN'])

In [11]:
dframe['dataset1'].groupby([cities,month]).mean()

LA  FEB    0.082489
    JAN    0.719690
NY  FEB    0.548029
    JAN    0.893423
Name: dataset1, dtype: float64

In [12]:
dframe.groupby('k1').mean()

    dataset1  dataset2
k1
X   0.450731  0.353263
Y   0.633859  0.506021
Z   0.967873  0.149909

In [13]:
dframe.groupby(['k1','k2']).mean()

          dataset1  dataset2
k1 k2
X  alpha  0.818973  0.296009
   beta   0.082489  0.410518
Y  alpha  0.719690  0.580187
   beta   0.548029  0.431855
Z  alpha  0.967873  0.149909

In [14]:
dframe.groupby(['k1']).size()

k1
X    2
Y    2
Z    1
dtype: int64

In [24]:
for name, group in dframe.groupby('k1'):
    print("This is the %s group" %name)
    print(group)
    print(name)
    print('\n')

This is the X group
   dataset1  dataset2 k1     k2
0  0.818973  0.296009  X  alpha
1  0.082489  0.410518  X   beta
X


This is the Y group
   dataset1  dataset2 k1     k2
2  0.719690  0.580187  Y  alpha
3  0.548029  0.431855  Y   beta
Y


This is the Z group
   dataset1  dataset2 k1     k2
4  0.967873  0.149909  Z  alpha
Z

In [25]:
dframe

   dataset1  dataset2 k1     k2
0  0.818973  0.296009  X  alpha
1  0.082489  0.410518  X   beta
2  0.719690  0.580187  Y  alpha
3  0.548029  0.431855  Y   beta
4  0.967873  0.149909  Z  alpha

In [22]:
for (k1,k2), group in dframe.groupby(['k1','k2']):
    print("Key1 = %s  Kkey2 %s" %(k1,k2))
    print(group)
    print ('\n')

Key1 = X  Kkey2 alpha
   dataset1  dataset2 k1     k2
0  0.818973  0.296009  X  alpha


Key1 = X  Kkey2 beta
   dataset1  dataset2 k1    k2
1  0.082489  0.410518  X  beta


Key1 = Y  Kkey2 alpha
   dataset1  dataset2 k1     k2
2   0.71969  0.580187  Y  alpha


Key1 = Y  Kkey2 beta
   dataset1  dataset2 k1    k2
3  0.548029  0.431855  Y  beta


Key1 = Z  Kkey2 alpha
   dataset1  dataset2 k1     k2
4  0.967873  0.149909  Z  alpha

In [23]:
group_dict = dict(list(dframe.groupby('k1')))
group_dict['X']

   dataset1  dataset2 k1     k2
0  0.818973  0.296009  X  alpha
1  0.082489  0.410518  X   beta

In [ ]:
group_dict = dict(list(dframe.groupby('k1')))